PiBoxY/msp430ware/energy_measurement/gui/DeviceConfig/SourceTemplates/MSP430i2xx/DesignCenter/emDC/emDCCommandHandlers.h
/*******************************************************************************
* Define used to identify packet as EM GUI Design Center packet
*******************************************************************************/
#define COMMAND_HANDLER_EM_GUI_ID_BYTE                      0x04
/*******************************************************************************
*  EM GUI Design Center Configuration packet
*******************************************************************************/
#define COMMAND_HANDLER_CONFIG_MODE                         0x01
#define COMMAND_HANDLER_APP_VERSION                         0x02
#define COMMAND_HANDLER_REQ_CALIB_VALUES                    0x03
#define COMMAND_HANDLER_ADC_BUFFER_SIZE                     0x04
// Command 0x05-0x7F  are reserved for future configuration commands

/*******************************************************************************
* EM GUI Design Center Result packet
*******************************************************************************/
#define COMMAND_HANDLER_VRMS_ID                             0x80
#define COMMAND_HANDLER_IRMS_ID                             0x81
#define COMMAND_HANDLER_VPEAK_ID                            0x82
#define COMMAND_HANDLER_IPEAK_ID                            0x83
#define COMMAND_HANDLER_POWER_FACTOR_ID                     0x84
#define COMMAND_HANDLER_FREQUENCY_ID                        0x85
#define COMMAND_HANDLER_ACTIVE_POWER_ID                     0x86
#define COMMAND_HANDLER_REACTIVE_POWER_ID                   0x87
#define COMMAND_HANDLER_APPARENT_POWER_ID                   0x88
#define COMMAND_HANDLER_ACTIVE_ENERGY_ID                    0x89
#define COMMAND_HANDLER_REACTIVE_ENERGY_ID                  0x8A
#define COMMAND_HANDLER_APPARENT_ENERGY_ID                  0x8B
// Command 0x8C-0xAF  are reserved for future result commands

/*******************************************************************************
*  EM GUI Design Center Calibration packet
*******************************************************************************/
#define COMMAND_HANDLER_CALIB_VALUES                        0xB0
#define COMMAND_HANDLER_CALIB_PHASE                         0xB1
#define COMMAND_HANDLER_CALIB_SAVE                          0xB2
// Command 0xB3-0xFF  are reserved for future calibration commands

/*******************************************************************************
*  EM GUI Calibration Request Flag Values for COMMAND_HANDLER_REQ_CALIB_VALUES
*******************************************************************************/
#define COMMAND_HANDLER_CALIB_REQ_IDLE                      0x00
#define COMMAND_HANDLER_CALIB_REQ_IN_PROGRESS               0x01
#define COMMAND_HANDLER_CALIB_REQ_COMPLETED                 0x02

typedef enum _COMMAND_HANDLER_DEVICE_TYPE_
{
    COMMAND_HANDLER_DEVICE_TYPE_i2021 =  0x01,
    COMMAND_HANDLER_DEVICE_TYPE_i2031 =  0x03,
    COMMAND_HANDLER_DEVICE_TYPE_i2041 =  0x05,
    COMMAND_HANDLER_DEVICE_TYPE_F6736 =  0x25,
    COMMAND_HANDLER_DEVICE_TYPE_F6736A = 0x2B,
    COMMAND_HANDLER_DEVICE_TYPE_F6779 =  0x74,
    COMMAND_HANDLER_DEVICE_TYPE_F6779A = 0x79,
    COMMAND_HANDLER_DEVICE_TYPE_F67791 = 0x84,
    COMMAND_HANDLER_DEVICE_TYPE_F67791A =0x89,
} COMMAND_HANDLER_DEVICE_TYPE;

typedef enum _COMMAND_HANDLER_FIRMWARE_ID_
{
    COMMAND_HANDLER_FIRMWARE_ID_0001 = 0,
}COMMAND_HANDLER_FIRMWARE_ID;

// global
typedef struct _COMAND_HANDLER_
{
    /* Initializations  */
    COMMAND_HANDLER_DEVICE_TYPE deviceId;
    COMMAND_HANDLER_FIRMWARE_ID fwId;

    /* Calibration Phase */
    uint8_t calibPhaseID;
    uint8_t calibPhaseIdx;

    /* Application Mode */
    uint8_t appMode;

    /* Calibration Request Status */
    uint8_t calibReqUpdate;

    /* GUI Semaphores   */
    bool calibSetPreloadFlag;
    bool calibReqSaveFlag;
    bool calibPhaseIdxFlag;
}COMAND_HANDLER;


extern COMAND_HANDLER gCommandHandler;

COMAND_HANDLER * CommandHandler_getUserParamsPtr(void);

extern void CommandHandler_registerCmdListeners();
extern void CommandHandler_prepareForParamUpdate(uint8_t command);
extern void CommandHandler_rxUpdate(uint8_t command, int32_t* ptimeOut);
extern void CommandHandler_transmitPacket(Packet_t *packet);
// added for debug purposes
extern void CommandHandler_transmitErrorPacket(Packet_t *packet,
        EM_message_code code);
extern void CommandHandler_transmitUserMessagePacket(Packet_t *packet,
        uint16_t appMessageCode);
extern void CommandHandler_updateParams(Packet_t *packet);
extern void CommandHandler_transmitCaptures(Packet_t *packet);
extern void CommandHandler_transmitResults(Packet_t *packet,
        EM_Total_Results* algRes);
extern void CommandHandler_transmitCapturePackages(Packet_t *packet,
            uint8_t id, uint8_t numOfPcks, int8_t finalPckLenght,
            uint8_t* pCap);
extern void CommandHandler_setApplicationVersion(
        COMMAND_HANDLER_DEVICE_TYPE deviceID,
        COMMAND_HANDLER_FIRMWARE_ID fwId);
extern void CommandHandler_transmittDebugData(
        Packet_t *packet, float data);


extern void CommandHandler_transmitVRMS(Packet_t *packet,
                                        uint8_t phaseID,
                                        uint8_t *vrms);
extern void CommandHandler_transmitIRMS(Packet_t *packet,
                                        uint8_t phaseID,
                                        uint8_t *irms);
extern void CommandHandler_transmitVPeak(Packet_t *packet,
                                        uint8_t phaseID,
                                        uint8_t *vPeak);
extern void CommandHandler_transmitIPeak(Packet_t *packet,
                                        uint8_t phaseID,
                                        uint8_t *iPeak);
extern void CommandHandler_transmitPowerFactor(Packet_t *packet,
                                               uint8_t phaseID,
                                               uint8_t *pFactor);
extern void CommandHandler_transmitFrequency(Packet_t *packet,
                                             uint8_t phaseID,
                                             uint8_t *frequency);
extern void CommandHandler_transmitActivePower(Packet_t *packet,
                                               uint8_t phaseID,
                                               uint8_t *actPower);
extern void CommandHandler_transmitReactivePower(Packet_t *packet,
                                                uint8_t phaseID,
                                                uint8_t *reactPower);
extern void CommandHandler_transmitApparentPower(Packet_t *packet,
                                                 uint8_t phaseID,
                                                 uint8_t *appPower);
extern void CommandHandler_transmitActiveEnergy(Packet_t *packet,
                                                uint8_t phaseID,
                                                uint8_t *actEnergy);
extern void CommandHandler_transmitReactiveEnergy(Packet_t *packet,
                                                 uint8_t phaseID,
                                                 uint8_t *reactEnergy);
extern void CommandHandler_transmitApparentEnergy(Packet_t *packet,
                                                  uint8_t phaseID,
                                                  uint8_t *appEnergy);
extern void CommandHandler_transmitCalibration(Packet_t *packet,
                                               uint8_t phaseID,
                                               uint8_t *calib);
extern void CommandHandler_transmitReqCalibrationValues(Packet_t *packet);
extern void CommandHandler_transmitCalibrationSave(Packet_t *packet);

#endif /* EMDCCOMMANDHANDLERS_H_ */
